Autodesk.Revit.DB.ViewDisplayDepthCueing.SetStartEndPercentages(System.Int32,System.Int32)
Sets start and end percentages.
startPercentage:
The start percentage defines where depth cueing starts.
endPercentage:
The end percentage defines where depth cueing ends.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The start and end percentages values are not valid. The valid range is 0 to 100 and start is smaller than end.
Since:
2017

Autodesk.Revit.DB.ViewDisplayDepthCueing.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewDisplayDepthCueing.FadeTo
The fade to defines the maximum fading in per cent.
Values between 0 and 100.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The fade to value is not valid. The valid range is 0 to 100.
Since:
2017

Autodesk.Revit.DB.ViewDisplayDepthCueing.EndPercentage
The end percentage defines where depth cueing ends.
Values between 0 and 100.
Since:
2017

Autodesk.Revit.DB.ViewDisplayDepthCueing.StartPercentage
The start percentage defines where depth cueing starts.
Values between 0 and 100.
Since:
2017

Autodesk.Revit.DB.ViewDisplayDepthCueing.EnableDepthCueing
True to enable depth cueing. False to disable it.
Since:
2017

Autodesk.Revit.DB.ViewDisplayDepthCueing
Represents the settings for depth cueing.
Since:
2017